In [1]:
import numpy as np
import pandas as pd

In [3]:
# create a data frame
df1 = pd.DataFrame({'k1':list('XXYYZ'),
                    'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
df1

   dataset1  dataset2 k1     k2
0  1.059563 -0.153346  X  alpha
1 -1.314812 -1.033353  X   beta
2  0.063592  0.521678  Y  alpha
3 -0.574193  0.530819  Y   beta
4 -1.070406  2.099920  Z  alpha

In [6]:
# group by k1 key
group1 = df1['dataset1'].groupby(df1['k1'])
# show that we now have a group object (won't actually display data)
group1

In [7]:
# mean of each group
group1.mean()

k1
X   -0.127624
Y   -0.255301
Z   -1.070406
Name: dataset1, dtype: float64

In [8]:
# create arrays of cities and months
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
months = np.array(['Jan', 'Feb', 'Jan', 'Feb', 'Jan'])

In [9]:
df1['dataset1'].groupby([cities, months]).mean()

LA  Feb   -1.314812
    Jan    0.063592
NY  Feb   -0.574193
    Jan   -0.005422
Name: dataset1, dtype: float64

In [12]:
# group both datasets by k1
df1.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.127624 -0.593349
Y  -0.255301  0.526248
Z  -1.070406  2.099920

In [13]:
# group both data sets by both keys
df1.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.059563 -0.153346
   beta  -1.314812 -1.033353
Y  alpha  0.063592  0.521678
   beta  -0.574193  0.530819
Z  alpha -1.070406  2.099920

In [15]:
# we can pull the counts/size of each group too
df1.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
# iterate over groups
for name, group in df1.groupby('k1'):
    print('The group name is {}'.format(name))
    print(group)
    print('\n')

The group name is X
   dataset1  dataset2 k1     k2
0  1.059563 -0.153346  X  alpha
1 -1.314812 -1.033353  X   beta


The group name is Y
   dataset1  dataset2 k1     k2
2  0.063592  0.521678  Y  alpha
3 -0.574193  0.530819  Y   beta


The group name is Z
   dataset1  dataset2 k1     k2
4 -1.070406   2.09992  Z  alpha

In [20]:
# iterate by multiple keys
for (k1, k2), group in df1.groupby(['k1', 'k2']):
    print('Key 1 = {}, Key 2 = {}'.format(k1, k2))
    print(group)
    print('\n')

Key 1 = X, Key 2 = alpha
   dataset1  dataset2 k1     k2
0  1.059563 -0.153346  X  alpha


Key 1 = X, Key 2 = beta
   dataset1  dataset2 k1    k2
1 -1.314812 -1.033353  X  beta


Key 1 = Y, Key 2 = alpha
   dataset1  dataset2 k1     k2
2  0.063592  0.521678  Y  alpha


Key 1 = Y, Key 2 = beta
   dataset1  dataset2 k1    k2
3 -0.574193  0.530819  Y  beta


Key 1 = Z, Key 2 = alpha
   dataset1  dataset2 k1     k2
4 -1.070406   2.09992  Z  alpha

### Group By Lists and Series

In [22]:
# create animals data frame
animals = pd.DataFrame(np.arange(16).reshape(4, 4),
                       columns = list('WXYZ'),
                       index = ['Dog', 'Cat', 'Bird', 'Mouse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [24]:
# set index 1 values for W and Y to null
animals.ix[1:2, ['W', 'Y']] = np.nan
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [25]:
# create a behavior map
behavior_map = {'W':'good', 'X':'bad', 'Y':'good', 'Z':'bad'}

In [28]:
# sum up good and bad for each index row
animal_col = animals.groupby(behavior_map, axis = 1)
animal_col.sum()

       bad  good
Dog      4     2
Cat     12   NaN
Bird    20    18
Mouse   28    26

In [30]:
# we can also count the values
animal_col.count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [34]:
# find the max in each category
animal_col.max()

       bad  good
Dog      3     2
Cat      7   NaN
Bird    11    10
Mouse   15    14

In [31]:
# sum each column by length
animals.groupby(len).sum()

    W   X   Y   Z
3   0   6   2  10
4   8   9  10  11
5  12  13  14  15